laurigates/mcu-tinkering-lab/packages/esp32-projects/esp32-ps4-speaker/sdkconfig.defaults
# ESP32-S3 PS4 Speaker — sdkconfig defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Bluepad32 (custom platform for PS4 controller) ---
CONFIG_BLUEPAD32_PLATFORM_CUSTOM=y

# --- Bluetooth (required for Bluepad32 + PS4 classic BT) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=4
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# --- Console (USB-Serial-JTAG for logging) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Compiler (suppress GCC 13+ warnings in vendored btstack) ---
CONFIG_COMPILER_DISABLE_GCC13_WARNINGS=y

# --- No WiFi needed ---
CONFIG_ESP_WIFI_ENABLED=n

# --- No PSRAM needed ---
CONFIG_SPIRAM=n

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# --- Power Management ---
CONFIG_PM_ENABLE=n
